{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "userDefinedMetadata": {"signature": {"inputs": {"dense_input:0": {"name": "dense_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "6"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "5"}]}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "4"}]}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "unknown_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "unknown_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "1"}]}}}}}, {"name": "unknown_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "dense_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd", "op": "_FusedMatMul", "input": ["dense_input", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense/BiasAdd", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense_2/BiasAdd", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_4/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense_3/BiasAdd", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/dense_4/BiasAdd", "unknown_9", "unknown_10"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [3, 6], "dtype": "float32"}, {"name": "unknown_0", "shape": [6], "dtype": "float32"}, {"name": "unknown_1", "shape": [6, 5], "dtype": "float32"}, {"name": "unknown_2", "shape": [5], "dtype": "float32"}, {"name": "unknown_3", "shape": [5, 4], "dtype": "float32"}, {"name": "unknown_4", "shape": [4], "dtype": "float32"}, {"name": "unknown_5", "shape": [4, 2], "dtype": "float32"}, {"name": "unknown_6", "shape": [2], "dtype": "float32"}, {"name": "unknown_7", "shape": [2, 2], "dtype": "float32"}, {"name": "unknown_8", "shape": [2], "dtype": "float32"}, {"name": "unknown_9", "shape": [2, 1], "dtype": "float32"}, {"name": "unknown_10", "shape": [1], "dtype": "float32"}]}]}